In [2]:
# Importando libs
import pandas as pd

In [3]:
# Criando daframe a partir do arquivo 'data/data.csv'
df = pd.read_csv('data/data.csv')

In [4]:
# Exibindo informações do daframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9942 entries, 0 to 9941
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  9942 non-null   int64
 1   data        9941 non-null   object
 2   hora        9692 non-null   object
 3   sexo        9940 non-null   object
 4   idade       9940 non-null   object
 5   funcao      9940 non-null   object
 6   categoria   9940 non-null   object
 7   compra      5266 non-null   object
 8   valor       5224 non-null   object
dtypes: int64(1), object(8)
memory usage: 699.2+ KB

In [5]:
# Exibindo as 5 primeiras linhas do dataframe
df.head()

   Unnamed: 0        data hora sexo idade funcao categoria compra valor
0           0  2014-03-25  NaN    m     c      b         a    NaN   NaN
1           1  2014-03-25  NaN    f     b      a         a      s   NaN
2           2  2014-03-25  NaN    m     c      b         d    NaN   NaN
3           3  2014-03-25  NaN    m     c      b         d      s   NaN
4           4  2014-03-25  NaN    m     c      d         d      s   NaN

In [6]:
# Removendo a coluna com indice 0, essa coluna é o id (primary key) oriundo da tabela na base de dados
df = df.drop(df.columns[[0]], axis=1)

In [7]:
# Exibindo novamente as 5 primeiras linhas do daframe
df.head()

         data hora sexo idade funcao categoria compra valor
0  2014-03-25  NaN    m     c      b         a    NaN   NaN
1  2014-03-25  NaN    f     b      a         a      s   NaN
2  2014-03-25  NaN    m     c      b         d    NaN   NaN
3  2014-03-25  NaN    m     c      b         d      s   NaN
4  2014-03-25  NaN    m     c      d         d      s   NaN

In [8]:
# Exibindo informações do dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9942 entries, 0 to 9941
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   data       9941 non-null   object
 1   hora       9692 non-null   object
 2   sexo       9940 non-null   object
 3   idade      9940 non-null   object
 4   funcao     9940 non-null   object
 5   categoria  9940 non-null   object
 6   compra     5266 non-null   object
 7   valor      5224 non-null   object
dtypes: object(8)
memory usage: 621.5+ KB

In [9]:
# Exibindo quantidade de linhas e colunas do dafaframe
df.shape

(9942, 8)

In [10]:
# Exibindo descrição do index
df.index

RangeIndex(start=0, stop=9942, step=1)

In [11]:
# Exibindo colunas presentes no dataframe
df.columns

Index(['data', 'hora', 'sexo', 'idade', 'funcao', 'categoria', 'compra',
       'valor'],
      dtype='object')

In [12]:
# Exibindo contagem de dados nao-nulos em cada coluna
df.count()

data         9941
hora         9692
sexo         9940
idade        9940
funcao       9940
categoria    9940
compra       5266
valor        5224
dtype: int64

In [13]:
# Imprimindo as colunas do dataframe
print(list(df.columns.values))

['data', 'hora', 'sexo', 'idade', 'funcao', 'categoria', 'compra', 'valor']

In [14]:
# Imprimindo a quantidade de registros do dataframe
print(df.count())

data         9941
hora         9692
sexo         9940
idade        9940
funcao       9940
categoria    9940
compra       5266
valor        5224
dtype: int64

In [15]:
# Obtendo valores unicos da coluna funcao
print(df['funcao'].unique())

['b' 'a' 'd' 'c' nan]

In [16]:
# Funcao para tratar a coluna FUNCAO
def trata_funcao(s):
    if s == 'a':
        return 'Aluno'
    elif s == 'b':
        return 'Funcionario'
    elif s == 'c':
        return 'Professor'
    elif s == 'd':
        return 'Outros'

In [17]:
# Criando nova coluna FUNCAO_TRATADA com dados tratados
df['FUNCAO_TRATADA'] = df['funcao'].apply(trata_funcao)

In [18]:
# Obtendo valores unicos da coluna 'categoria''
print(df['categoria'].unique())

['a' 'd' 'b' 'e' 'i' 'g' 'k' 'j' 'c' 'h' 'f' nan]

In [19]:
# Funcao para tratar a coluna CATEGORIA
def trata_categoria(s):
    if s == 'a':
        return 'Acessorios'
    elif s == 'b':
        return 'Apple'
    elif s == 'c':
        return 'Cameras'
    elif s == 'd':
        return 'Impressoras'
    elif s == 'e':
        return 'Notebooks'
    elif s == 'f':
        return 'Softwares'
    elif s == 'g':
        return 'Telecom'
    elif s == 'h':
        return 'Tablet'
    elif s == 'i':
        return 'Games'
    elif s == 'j':
        return 'Servicos'
    elif s == 'k':
        return 'Outros'

In [20]:
# Criando nova coluna CATEGORIA_TRATADA com dados tratados
df['CATEGORIA_TRATADA'] = df['categoria'].apply(trata_categoria)

In [21]:
# Exibindo valores unicos da coluna 'compra'
print(df['compra'].unique())

[nan 's']

In [22]:
# Funcao para tratar a coluna COMPRA
def trata_compra(s):
    if s == 's':
        return 'Sim'
    else:
        return 'Nao'

In [23]:
# Criando nova coluna COMPROU com dados tratados na coluna 'compra'
df['COMPROU'] = df['compra'].apply(trata_compra)

In [24]:
# Exibindo valores unicos da coluna 'sexo'
print(df['sexo'].unique())

['m' 'f' nan]

In [25]:
# Funcao para tratar a coluna SEXO
def trata_sexo(s):
    if s == 'm':
        return 'Masculino'
    else:
        return 'Feminino'

In [26]:
# Criando nova coluna SEXO_TRATADO com dados tratados na coluna 'sexo'
df['SEXO_TRATADO'] = df['sexo'].apply(trata_sexo)

In [27]:
# Exibindo valores unicos da coluna 'idade'
print(df['idade'].unique())

['c' 'b' 'd' 'a' nan]

In [28]:
# Funcao para tratar a coluna IDADE
def trata_idade(s):
    if s == 'a':
        return 'Menor de 18'
    elif s == 'b':
        return 'Entre 18 e 30'
    elif s == 'c':
        return 'Entre 30 e 60'
    else:
        return 'Maior de 60'

In [29]:
# Criando nova coluna IDADE_TRATADA com dados tratados na coluna 'idade'
df['IDADE_TRATADA'] = df['idade'].apply(trata_idade)

In [30]:
# Exibindo as 5 primeiras linhas do daframe
df.head()

,data,hora,sexo,idade,funcao,categoria,compra,valor,FUNCAO_TRATADA,CATEGORIA_TRATADA,COMPROU,SEXO_TRATADO,IDADE_TRATADA
0,2014-03-25,NaN,m,c,b,a,NaN,NaN,Funcionario,Acessorios,Nao,Masculino,Entre 30 e 60
1,2014-03-25,NaN,f,b,a,a,s,NaN,Aluno,Acessorios,Sim,Feminino,Entre 18 e 30
2,2014-03-25,NaN,m,c,b,d,NaN,NaN,Funcionario,Impressoras,Nao,Masculino,Entre 30 e 60
3,2014-03-25,NaN,m,c,b,d,s,NaN,Funcionario,Impressoras,Sim,Masculino,Entre 30 e 60
4,2014-03-25,NaN,m,c,d,d,s,NaN,Outros,Impressoras,Sim,Masculino,Entre 30 e 60

In [31]:
# Removendo colunas que não sera utilizadas
df.drop(['sexo', 'idade','funcao','categoria','compra'], axis=1, inplace=True)

In [32]:
# Renomeando colunas
df.rename(columns={"FUNCAO_TRATADA":"funcao","CATEGORIA_TRATADA":"categoria","SEXO_TRATADO": "genero","IDADE_TRATADA": "faixa_etaria","COMPROU":"comprou"})

,data,hora,valor,funcao,categoria,comprou,genero,faixa_etaria
0,2014-03-25,NaN,NaN,Funcionario,Acessorios,Nao,Masculino,Entre 30 e 60
1,2014-03-25,NaN,NaN,Aluno,Acessorios,Sim,Feminino,Entre 18 e 30
2,2014-03-25,NaN,NaN,Funcionario,Impressoras,Nao,Masculino,Entre 30 e 60
3,2014-03-25,NaN,NaN,Funcionario,Impressoras,Sim,Masculino,Entre 30 e 60
4,2014-03-25,NaN,NaN,Outros,Impressoras,Sim,Masculino,Entre 30 e 60
...,...,...,...,...,...,...,...,...
9937,2018-07-04,16:17,NaN,Funcionario,Acessorios,Nao,Masculino,Entre 18 e 30
9938,2018-07-05,12:43,"R$ 20,00",Funcionario,Acessorios,Sim,Masculino,Entre 18 e 30
9939,2018-07-05,14:34,"R$ 10,00",Funcionario,Acessorios,Sim,Masculino,Entre 18 e 30
9940,2018-07-05,14:47,NaN,Outros,Acessorios,Nao,Masculino,Entre 30 e 60
9941,2018-07-05,15:18,NaN,Outros,Acessorios,Nao,Feminino,Maior de 60

In [33]:
# Exibindo quantidade de linhas e colunas do dataframe
df.shape

(9942, 8)

In [34]:
# Removendo linhas com valores nulos
df.dropna(inplace=True)

In [35]:
# Exibindo quantidade de linhas e colunas do dataframe
df.shape

(5223, 8)

In [36]:
# Exibindo as 5 primeiras linhas do daframe
df.head()

,data,hora,valor,FUNCAO_TRATADA,CATEGORIA_TRATADA,COMPROU,SEXO_TRATADO,IDADE_TRATADA
287,2014-03-31,14:55,"R$ 90,00",Outros,Impressoras,Sim,Feminino,Maior de 60
288,2014-03-31,16:16,"R$ 36,00",Funcionario,Acessorios,Sim,Masculino,Entre 18 e 30
295,2014-04-01,11:44,"R$ 72,00",Aluno,Acessorios,Sim,Feminino,Entre 18 e 30
296,2014-04-01,12:51,"R$ 62,00",Funcionario,Acessorios,Sim,Masculino,Entre 30 e 60
297,2014-04-01,12:58,"R$ 40,00",Aluno,Acessorios,Sim,Feminino,Entre 18 e 30

In [37]:
# Exibindo valores unicos para a coluna 'valor'
print(df['valor'].unique())

['R$ 90,00' 'R$ 36,00' 'R$ 72,00' 'R$ 62,00' 'R$ 40,00' 'R$ 30,00'
 'R$ 25,00' 'R$ 24,00' 'R$ 20,00' 'R$ 44,00' 'R$ 16,00' 'R$ 230,00'
 'R$ 45,00' 'R$ 135,00' 'R$ 80,00' 'R$ 28,00' 'R$ 63,00' 'R$ 540,00'
 'R$ 120,00' 'R$ 150,00' 'R$ 65,00' 'R$ 26,00' 'R$ 8,00' 'R$ 70,00'
 'R$ 144,00' 'R$ 60,00' 'R$ 173,00 ' 'R$ 280,00' 'R$ 75,00' 'R$ 82,00'
 'R$ 464,00' 'R$ 10,00' 'R$ 110,00' 'R$ 54,00' 'R$ 55,00' 'R$ 185,00'
 'R$ 560,00' 'R$ 165,00' 'R$ 48,00' 'R$ 180,00' 'R$ 200,00' 'R$ 119,00'
 'R$ 100,00' 'R$ 130,00' 'R$ 140,00' 'R$ 279,00' 'R$ 50,00' 'R$ 420,00'
 'R$ 32,00' 'R$ 590,00' 'R$ 92,00' 'R$ 113,00' 'R$ 96,00' 'R$ 320,00'
 'R$ 137,00' 'R$ 12,00' 'R$ 145,00' 'R$ 250,00' 'R$ 2.400,00' 'R$ 190,00'
 'R$ 35,00' 'R$ 299,00' 'R$ 105,00' 'R$ 367,00' 'R$ 295,00' 'R$ 194,00'
 'R$ 1.724,00' 'R$ 41,00' 'R$ 34,00' 'R$ 680,00' 'R$ 1694,00' 'R$ 470,00'
 'R$ 107,00' 'R$ 189,00' 'R$ 210,00' 'R$ 380,00' 'R$ 217,00' 'R$ 215,00'
 'R$ 6,00' 'R$ 110' 'R$ 99,00' 'R$ 19,00' 'R$ 426,00' 'R$ 64,00'
 'R$ 38,00' 'R$ 58,00' 'R$ 1.822,00' 'R$ 124,00' 'R$ 37,00' 'R$ 29,00'
 'R$ 39,00' 'R$ 179,00' 'R$ 640,00' 'R$ 42,00' 'R$ 260,00' 'R$ 15,00'
 'R$ 160,00' 'R$ 175,00' 'R$ 240,00' 'R$ 147,00' 'R$ 153,00' 'R$ 114,00'
 '25,00' 'R$ 188,00' 'R$ 849,00' 'R$ 300,00' 'R$ 405,00' 'R$ 310,00'
 'R$ 129,00' 'R$ 1690,00' 'R$ 95,00' 'R$175,00' 'R$ 2.912,75' 'R$ 1100,00'
 'R$ 85,00' 'R$ 76,00' 'R$ 2.221,00' 'R$ 1.125,00' 'R$ 47,00' 'R$ 2486,00'
 'R$ 359,00' 'R$ 4.182,00' 'R$ 2.039,00' 'R$ 186,00' 'R$ 128,00'
 'R$ 520,00' 'R$ 165' 'R$ 2,00' 'R$ 143,00' 'R$ 1190,00' 'R$ 78,00'
 'R$ 136,00' '20,00' 'R$ 1090,00' 'R$ 1245,00' 'R$ 4.800,00' 'R$ 170,00'
 'R$ 1.900,00' 'R$ 56,85' 'R$ 2.970,00' 'R$ 118,00' 'R$ 98,00' 'R$ 164,00'
 'R$ 10,00 ' 'R$ 298,00' 'R$ 255,00' 'R$ 68,00' 'R$ 525,00' 'R$ 970,00'
 'R$ 449,00' 'R$ 23,50' 'R$ 650,00' 'R$ 218,00' 'R$ 101,00' 'R$ 52,00'
 'R$ 5.780,00' 'R$ 1.660,00' 'R$v 8,00' 'R$ 999,00' 'R$ 138,00'
 'R$ 125,00' 'R$ 480,00' 'R$ 102,00' 'R$ 57,00' 'R$ 142,00' 'R$ 304,00'
 'R$ 86,00' 'R$ 109,00' 'R$ 685,00' 'R$ 0,00' 'R$ 7.371,00' 'R$ 1.700,00'
 'R$ 123,00' 'R$ 12.738,38' 'R$ 1.400,00' 'R$ 66,00' 'R$ 1.970,00'
 'R$ 340,00' 'R$ 133,00' 'R$ 2.070,00' 'R$ 1.832,00' 'R$ 689,00'
 'R$ 865,00' 'R$ 1.890,00' 'R$ 360,00' 'R$ 149,00' 'R$ 94,00' 'R$ 398,00'
 'R$ 845,00' 'R$ 59,00' 'R$ 5,00' 'R$ 16,90' 'R$ 89,00' 'R$ 159,00'
 'R$ 18,00' 'R$ 390,00' 'R$ 69,00' 'R$ 115,00' 'R$ 49,00' 'R$ 23,00'
 'R$ 152,00' 'R$ 330,30' 'R$ 9,00' 'R$ 205,00' 'R$ 322,00' 'R$ 339,00'
 'R$ 219,00' 'R$ 108,00' 'R$ 530,00' 'R$ 46,00' 'R$ 427,00' 'R$ 389,00'
 'R$ 79,00' 'R$ 169,00' 'R$ 88,00' 'R$ 349,00' 'R$ 437,00' 'R$ 2.200,00'
 'R$ 399,00' 'R$ 77,00' 'R$ 208,00' 'R$ 229,00' 'R$ 148,00' 'R$ 111,00'
 'R$ 237,00' 'R$ 409,00' 'R$ 27,00' 'R$ 248,00' 'R$ 220,00' 'R$ 388,00'
 'R$ 288,00' 'R$ 198,00' 'R$ 400,00' 'R$ 370,00' 'R$ 139,00' 'R$ 104,00'
 'R$ 27,50' 'R$ 199,00' 'R$177,00' 'R$ 2190,00' 'R$ 249,00' 'R$ 141,00'
 'R$ 268,00' 'R$39,00' 'R$ 149,0' 'R$ 311,00' 'R$ 289,00' 'R$ 79'
 'R$ 56,00' 'R$ 244,00' 'R$ 273,00' 'R$ 74,00' '68,00' 'R$ 158,00'
 'R$ 688,00' 'R$ 84,00' 'R$ 17,00' 'R$ 22,00' 'R$ 168,00' 'R$ 228,00'
 'R$5,00' 'R$ 178,00' 'R$ 265,00' 'R4 35,00' 'R$ 187,00' 'R4 99,00'
 'R$ 87,00' 'R$100,00' 'R$ 335,00' 'R$ 134,00' 'R$ 166,00' 'R4 59,00'
 'R$ 798,00' 'R4 39,00' 'R$ 117,00' 'R$ 3558,00' 'R4 79,00' 'R4 29,00'
 'R$ 1655,00' 'R$ 197,00' 'R$ 3,00' 'R$ 254,00' 'R$ 318,00' 'R4 48,00'
 'R4 49,00' 'R$ 29' 'R4 10,00' '$ 29,00' 'R$ 256,00' 'R$ 196,00'
 'R$ 155,00' 'R$ 177,00' 'R$ 126,00' 'R$ 396,00' 'R$ 195,00' 'R$ 127,00'
 'R$ 1,00' 'R$ 157,00' 'R$ 278,00' 'R$ 9,50' 'R$ 33,00' '40,00'
 'R$ 122,00' 'R$ 259,00' 'R$19,00' 'R$ 257,00' 'R$25,00' 'R$ 225,00' 'R$ '
 'R$ 650,90' 'R$ 348,00' 'R$ 163,00' 'R$ 600,00' 'R$ 317,00' 'R$ 4,00'
 'R$ 207,00' 'R$ 580,00' 'R$79,00' 'R$ 989,99' 'R$ 9,90']

In [38]:
# Fazendo slice na coluna valor para retirar 'R$ '
df['valor'] = df['valor'].str[3:]

In [39]:
# Exibindo valores unicos para coluna 'valor'
df['valor'].unique()

array(['90,00', '36,00', '72,00', '62,00', '40,00', '30,00', '25,00',
       '24,00', '20,00', '44,00', '16,00', '230,00', '45,00', '135,00',
       '80,00', '28,00', '63,00', '540,00', '120,00', '150,00', '65,00',
       '26,00', '8,00', '70,00', '144,00', '60,00', '173,00 ', '280,00',
       '75,00', '82,00', '464,00', '10,00', '110,00', '54,00', '55,00',
       '185,00', '560,00', '165,00', '48,00', '180,00', '200,00',
       '119,00', '100,00', '130,00', '140,00', '279,00', '50,00',
       '420,00', '32,00', '590,00', '92,00', '113,00', '96,00', '320,00',
       '137,00', '12,00', '145,00', '250,00', '2.400,00', '190,00',
       '35,00', '299,00', '105,00', '367,00', '295,00', '194,00',
       '1.724,00', '41,00', '34,00', '680,00', '1694,00', '470,00',
       '107,00', '189,00', '210,00', '380,00', '217,00', '215,00', '6,00',
       '110', '99,00', '19,00', '426,00', '64,00', '38,00', '58,00',
       '1.822,00', '124,00', '37,00', '29,00', '39,00', '179,00',
       '640,00', '42,00', '260,00', '15,00', '160,00', '175,00', '240,00',
       '147,00', '153,00', '114,00', '00', '188,00', '849,00', '300,00',
       '405,00', '310,00', '129,00', '1690,00', '95,00', '2.912,75',
       '1100,00', '85,00', '76,00', '2.221,00', '1.125,00', '47,00',
       '2486,00', '359,00', '4.182,00', '2.039,00', '186,00', '128,00',
       '520,00', '165', '2,00', '143,00', '1190,00', '78,00', '136,00',
       '1090,00', '1245,00', '4.800,00', '170,00', '1.900,00', '56,85',
       '2.970,00', '118,00', '98,00', '164,00', '10,00 ', '298,00',
       '255,00', '68,00', '525,00', '970,00', '449,00', '23,50', '650,00',
       '218,00', '101,00', '52,00', '5.780,00', '1.660,00', ' 8,00',
       '999,00', '138,00', '125,00', '480,00', '102,00', '57,00',
       '142,00', '304,00', '86,00', '109,00', '685,00', '0,00',
       '7.371,00', '1.700,00', '123,00', '12.738,38', '1.400,00', '66,00',
       '1.970,00', '340,00', '133,00', '2.070,00', '1.832,00', '689,00',
       '865,00', '1.890,00', '360,00', '149,00', '94,00', '398,00',
       '845,00', '59,00', '5,00', '16,90', '89,00', '159,00', '18,00',
       '390,00', '69,00', '115,00', '49,00', '23,00', '152,00', '330,30',
       '9,00', '205,00', '322,00', '339,00', '219,00', '108,00', '530,00',
       '46,00', '427,00', '389,00', '79,00', '169,00', '88,00', '349,00',
       '437,00', '2.200,00', '399,00', '77,00', '208,00', '229,00',
       '148,00', '111,00', '237,00', '409,00', '27,00', '248,00',
       '220,00', '388,00', '288,00', '198,00', '400,00', '370,00',
       '139,00', '104,00', '27,50', '199,00', '2190,00', '249,00',
       '141,00', '268,00', '149,0', '311,00', '289,00', '79', '56,00',
       '244,00', '273,00', '74,00', '158,00', '688,00', '84,00', '17,00',
       '22,00', '168,00', '228,00', ',00', '178,00', '265,00', '187,00',
       '87,00', '00,00', '335,00', '134,00', '166,00', '798,00', '117,00',
       '3558,00', '1655,00', '197,00', '3,00', '254,00', '318,00', '29',
       '256,00', '196,00', '155,00', '177,00', '126,00', '396,00',
       '195,00', '127,00', '1,00', '157,00', '278,00', '9,50', '33,00',
       '122,00', '259,00', '257,00', '225,00', '', '650,90', '348,00',
       '163,00', '600,00', '317,00', '4,00', '207,00', '580,00', '989,99',
       '9,90'], dtype=object)

In [40]:
# Transformando a coluna 'valor' em string
df['valor'] = df['valor'].astype(str)

In [41]:
# Substituindo o separador de centavos de , para .
df['valor'] = df['valor'].str.replace('.', ',')

<ipython-input-41-20ded5c8329c>:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df['valor'] = df['valor'].str.replace('.', ',')

In [42]:
# Fazendo slice para retirar os centavos do campo 'valor'
df['valor'] = df['valor'].str[:-3]

In [43]:
# Removendo espações vazios do campo 'valor'
df['valor'] = df['valor'].str.strip()

In [44]:
# Exibindo linhas com o campo 'valor' que nao tenha caracter algum
df[df['valor'].map(len) < 1]

,data,hora,valor,FUNCAO_TRATADA,CATEGORIA_TRATADA,COMPROU,SEXO_TRATADO,IDADE_TRATADA
968,2014-06-09,11:20,,Aluno,Impressoras,Sim,Masculino,Entre 30 e 60
1335,2014-08-04,15:6,,Funcionario,Acessorios,Sim,Masculino,Entre 30 e 60
1680,2014-09-02,17:24,,Aluno,Impressoras,Sim,Feminino,Entre 18 e 30
1810,2014-09-12,11:42,,Funcionario,Acessorios,Sim,Masculino,Entre 30 e 60
1978,2014-09-26,11:38,,Aluno,Acessorios,Sim,Masculino,Entre 18 e 30
4566,2015-09-03,18:8,,Professor,Acessorios,Sim,Feminino,Entre 30 e 60
4678,2015-09-18,13:20,,Funcionario,Acessorios,Sim,Masculino,Entre 30 e 60
5054,2015-11-03,15:37,,Aluno,Acessorios,Sim,Feminino,Entre 30 e 60
6065,2016-05-09,14:30,,Aluno,Acessorios,Sim,Masculino,Entre 18 e 30
6649,2016-08-09,13:39,,Funcionario,Acessorios,Sim,Masculino,Entre 30 e 60
7512,2017-01-16,16:1,,Aluno,Acessorios,Sim,Masculino,Entre 18 e 30

In [45]:
# Removendo linhas com o campo 'valor' vazio
df = df.drop(df[df.valor == ""].index)

In [46]:
# Exibindo linhas com o campo 'valor' que nao tenha caracter algum
df[df['valor'].map(len) < 1]

Empty DataFrame
Columns: [data, hora, valor, FUNCAO_TRATADA, CATEGORIA_TRATADA, COMPROU, SEXO_TRATADO, IDADE_TRATADA]
Index: []

In [47]:
# Substituindo , por . no campo 'valor'
df['valor'] = df['valor'].apply(lambda x: float(x.replace(".","").replace(",",".")))

In [48]:
# Exibindo as 10 primeiras linhas do daframe
df.head(10)

,data,hora,valor,FUNCAO_TRATADA,CATEGORIA_TRATADA,COMPROU,SEXO_TRATADO,IDADE_TRATADA
287,2014-03-31,14:55,90.0,Outros,Impressoras,Sim,Feminino,Maior de 60
288,2014-03-31,16:16,36.0,Funcionario,Acessorios,Sim,Masculino,Entre 18 e 30
295,2014-04-01,11:44,72.0,Aluno,Acessorios,Sim,Feminino,Entre 18 e 30
296,2014-04-01,12:51,62.0,Funcionario,Acessorios,Sim,Masculino,Entre 30 e 60
297,2014-04-01,12:58,40.0,Aluno,Acessorios,Sim,Feminino,Entre 18 e 30
301,2014-04-01,14:23,30.0,Funcionario,Acessorios,Sim,Feminino,Entre 30 e 60
303,2014-04-01,17:32,25.0,Funcionario,Acessorios,Sim,Feminino,Entre 30 e 60
309,2014-04-02,9:42,40.0,Outros,Acessorios,Sim,Masculino,Entre 30 e 60
310,2014-04-02,9:51,24.0,Aluno,Acessorios,Sim,Feminino,Entre 18 e 30
316,2014-04-02,13:33,36.0,Professor,Acessorios,Sim,Feminino,Entre 30 e 60

In [49]:
# Exibindo resumo estatistico do campo 'valor'
df['valor'].describe()

count    5212.000000
mean       63.526613
std       110.169123
min         0.000000
25%        25.000000
50%        39.000000
75%        69.000000
max      3558.000000
Name: valor, dtype: float64

In [50]:
# Exibindo a soma de todos os valores do campo 'valor'
print('O total de vendas foi: R$',  df['valor'].sum())

O total de vendas foi: R$ 331100.706

In [51]:
# Exibindo o maior valor vendido
print('O item mais caro foi vendido por: R$',  df['valor'].max())

O item mais caro foi vendido por: R$ 3558.0

In [52]:
# Exibindo o menor valor vendido
print('O item mais barato foi vendido por: R$',  df['valor'].min())

O item mais barato foi vendido por: R$ 0.0

In [53]:
# Exibindo a media dos valores
df['valor'].mean()

63.52661281657713

In [54]:
# Exibindo a mediana dos valores
df['valor'].median()

39.0

In [55]:
# Exportando o dataframe o arquivo 'data/data_tratado.csv'
df.to_csv("data/data_tratado.csv")

In [56]:
# Funcao para percorrer o campo valor e retirar todas as virgulas
#def trata_valor(s):
#    s = s.split(",")
#    return s

In [57]:
# Criando nova coluna VALOR_TRATADO com dados melhorados
#df['VALOR_TRATADO'] = df['valor'].apply(trata_valor)

In [58]:
#df['VALOR_TRATADO'] = df['VALOR_TRATADO'].str.replace(',', '')

In [59]:
#df['VALOR_TRATADO'].median(skipna=True)

In [60]:
#df.head()

In [61]:
#df['valor'] = df['valor'].astype(float)

In [62]:
#df.tail()

In [63]:
#df['valor'] = df['valor'].apply(lambda x: float(x.replace(".","").replace(",",".")))